/**
 * 各种枚举值，方便统一维护；
 * @file const.js
 **/
let CONST = {
    USER_LEVEL: [
        ['A', '总管理员权限'],
        ['B', '学院管理员权限'],
        ['C', '教师权限'],
        ['D', '学生权限'],
    ],
    MESSAGE_CODE: [
        ['0', '登录页公告'],
        ['1', '公共首页公告'],
        ['2', '全部总权限管理员'],
        ['3', '全部学院管理员'],
        ['4', '全部教师'],
        ['5', '全部学生'],
    ],
    MESSAGE_STATUS: [
        ['0', '已撤回'],
        ['1', '已发布'],
    ],
    INSTITUTE_CODE: [
        ['0', 'all'],
        ['1', '计算机科学技术 软件学院'],
        ['2', '东语学院'],
        ['3', '俄语学院'],
        ['4', '法学院'],
        ['5', '国防教育学院'],
        ['6', '化学化工与材料学院'],
        ['7', '机电工程学院']
    ]
}

export default CONST;